In [1]:
%autosave 20

import pandas as pd
import numpy as np

# print all the outputs in a cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

Autosaving every 20 seconds

In [2]:
snap = pd.read_excel('/Users/chensumei/Desktop/Ram Paper/FinalSheets/Combined SNAP Applications.xlsx', index_col=0)
warn = pd.read_excel('/Users/chensumei/Desktop/Ram Paper/FinalSheets/Combined Warn Data.xlsx',index_col=0)
disaster = pd.read_excel('/Users/chensumei/Desktop/Ram Paper/FinalSheets/Combined Disaster.xlsx', index_col=0)

In [ ]:
#google = pd.read_excel('/Users/chensumei/Desktop/Ram Paper/FinalSheets/final_google_combine.xlsx', index_col=0)

# snap

In [3]:
snap.head()

     County  SNAP_Applications  Year  Month  State
0  Anderson                405  2019      1  Texas
1  Anderson                243  2019      2  Texas
2  Anderson                282  2019      3  Texas
3  Anderson                274  2019      4  Texas
4  Anderson                317  2019      5  Texas

In [4]:
snap.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11231 entries, 0 to 11230
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   County             11231 non-null  object
 1   SNAP_Applications  11231 non-null  int64
 2   Year               11231 non-null  int64
 3   Month              11231 non-null  int64
 4   State              11231 non-null  object
dtypes: int64(3), object(2)
memory usage: 526.5+ KB

In [5]:
#filger 'Unavailable or Not a Texas County' +  'Statewide'

snap[snap.County == 'Unavailable or Not a Texas County']

Empty DataFrame
Columns: [County, SNAP_Applications, Year, Month, State]
Index: []

In [15]:
snap.shape

(11231, 5)

In [7]:
snap.isna().sum()

County               0
SNAP_Applications    0
Year                 0
Month                0
State                0
dtype: int64

# Warn

In [9]:
warn.head()

        State  Year  Month        County  Number of Workers
0  California  2019      1       Alameda                 45
1  California  2019      1         Butte               1373
2  California  2019      1  Contra Costa                  3
3  California  2019      1          Kern                134
4  California  2019      1   Los Angeles               1526

In [10]:
warn.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1174 entries, 0 to 1173
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   State              1174 non-null   object
 1   Year               1174 non-null   int64
 2   Month              1174 non-null   int64
 3   County             1174 non-null   object
 4   Number of Workers  1174 non-null   int64
dtypes: int64(3), object(2)
memory usage: 55.0+ KB

In [11]:
warn.County.unique()

array(['Alameda', 'Butte', 'Contra Costa', 'Kern', 'Los Angeles',
       'Orange', 'Placer', 'Riverside', 'Sacramento', 'San Bernardino',
       'San Diego', 'San Francisco', 'San Joaquin', 'San Mateo',
       'Santa Clara', 'Shasta', 'Tulare', 'Glenn', 'Nevada',
       'San Luis Obispo', 'Solano', 'Sonoma', 'Ventura', 'Fresno',
       'Imperial', 'Santa Cruz', 'Stanislaus', 'Tuolumne',
       'Santa Barbara', 'Napa', 'Tehama', 'Yolo', 'Yuba', 'Mendocino',
       'Kings', 'Sutter', 'Marin', 'Merced', 'Mono', 'Monterey',
       'San Benito', 'Amador', 'Calaveras', 'Colusa', 'El Dorado',
       'Humboldt', 'Inyo', 'Madera', 'Mariposa', 'Plumas', 'Del Norte',
       'Siskiyou', 'Dallas', 'Harris', 'Lamar', 'Tarrant', 'Travis',
       'Bexar', 'Chambers', 'Collin', 'Denton', 'El Paso', 'Midland',
       'Montgomery', 'Nueces', 'Austin', 'Bowie', 'Fayette', 'Grayson',
       'Smith', 'Brown', 'Potter', 'Ward', 'Fort Bend', 'Ector', 'Reeves',
       'Gregg', 'McLennan', 'Webb', 'Cameron', 'Johnson', 'Andrews',
       'Angelina', 'Ellis', 'Nacogdoches', 'Somervell', 'Deaf Smith',
       'Jefferson', 'Archer', 'Atascosa', 'Bastrop', 'Bell', 'Brazoria',
       'Brazos', 'Childress', 'Comal', 'Coryell', 'Erath', 'Galveston',
       'Hale', 'Hays', 'Henderson', 'Hidalgo', 'Hill', 'Howard', 'Jones',
       'Kaufman', 'Kendall', 'La Salle', 'Lubbock', 'Maverick', 'Morris',
       'Palo Pinto', 'Parker', 'Randall', 'Rockwall', 'Taylor',
       'Tom Green', 'Val Verde', 'Victoria', 'Walker', 'Waller',
       'Williamson', 'Wilson', 'Winkler', 'Wise', 'Colorado', 'Crane',
       'Crockett', 'Dawson', 'Frio', 'Gray', 'Guadalupe', 'Harrison',
       'Irion', 'Jim Wells', 'Kerr', 'Limestone', 'Matagorda', 'Polk',
       'Terry', 'Cass', 'Gillespie', 'Rusk', 'Yoakum', 'Bailey', 'Brooks',
       'Floyd', 'Liberty', 'San Patricio', 'Starr', 'Uvalde', 'Zavala',
       'Karnes', 'Reagan', 'Anderson', 'Wichita', 'Willacy', 'Hunt'],
      dtype=object)

In [16]:
warn.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1174 entries, 0 to 1173
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   State              1174 non-null   object
 1   Year               1174 non-null   int64
 2   Month              1174 non-null   int64
 3   County             1174 non-null   object
 4   Number of Workers  1174 non-null   int64
dtypes: int64(3), object(2)
memory usage: 55.0+ KB

In [14]:
warn.shape

(1174, 5)

# Disaster

In [21]:
disaster.shape

(820, 5)

In [18]:
disaster.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 820 entries, 0 to 819
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          820 non-null    object
 1   Year           820 non-null    int64
 2   Month          820 non-null    int64
 3   County         820 non-null    object
 4   # of disaster  820 non-null    int64
dtypes: int64(3), object(2)
memory usage: 38.4+ KB

In [19]:
disaster.isna().sum()

State            0
Year             0
Month            0
County           0
# of disaster    0
dtype: int64

In [23]:
disaster['# of disaster'].unique()

array([1, 2, 3])

# Join tables

In [24]:
X = pd.merge(snap, warn, on=['Year', 'Month', 'State', 'County'], how='outer')

In [28]:
X.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11231 entries, 0 to 11230
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   County             11231 non-null  object
 1   SNAP_Applications  11231 non-null  int64
 2   Year               11231 non-null  int64
 3   Month              11231 non-null  int64
 4   State              11231 non-null  object
 5   Number of Workers  11231 non-null  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 614.2+ KB

In [26]:
X.head()

     County  SNAP_Applications  Year  Month  State  Number of Workers
0  Anderson                405  2019      1  Texas                NaN
1  Anderson                243  2019      2  Texas                NaN
2  Anderson                282  2019      3  Texas                NaN
3  Anderson                274  2019      4  Texas                NaN
4  Anderson                317  2019      5  Texas                NaN

In [27]:
# fill nan with 0
X = X.fillna(0)

In [29]:
disaster.head()

        State  Year  Month                       County  # of disaster
0  California  2019      3  Cahuilla Indian Reservation              1
1  California  2019      3  La Jolla Indian Reservation              1
2  California  2019      4    Soboba Indian Reservation              1
3  California  2019      5                       Amador              1
4  California  2019      5                        Butte              1

In [36]:
df = pd.merge(X, disaster, on=['Year', 'Month', 'State', 'County'], how='outer' )

In [31]:
df.isna().sum()

County                   0
SNAP_Applications        9
Year                     0
Month                    0
State                    0
Number of Workers        9
# of disaster        10420
dtype: int64

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11240 entries, 0 to 11239
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   County             11240 non-null  object
 1   SNAP_Applications  11240 non-null  float64
 2   Year               11240 non-null  int64
 3   Month              11240 non-null  int64
 4   State              11240 non-null  object
 5   Number of Workers  11240 non-null  float64
 6   # of disaster      11240 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 960.5+ KB

In [39]:
# fill nan with 0
df = df.fillna(0)

In [43]:
df.County[3]

'Anderson'

In [49]:
# check number of reservation
idx = []

for i in range(len(df)):
    if df.County[i].__contains__('Reservation'):
        idx.append(i)
        
    if df.County[i].__contains__('reservation'):
        idx.append(i)

In [51]:
idx

[11231, 11232, 11233, 11234, 11235, 11237, 11238]

In [55]:
# output the excal

df.to_excel('snap_warn_disaster.xlsx')